Revit 2026 API

# FamilyInstanceGetSpatialElementFromToCalculationPoints Method

---

Gets the locations for the calculation points for this instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<XYZ> GetSpatialElementFromToCalculationPoints()
```
```vb
Public Function GetSpatialElementFromToCalculationPoints As IList(Of XYZ)
```
```cpp
public:
IList<XYZ^>^ GetSpatialElementFromToCalculationPoints()
```
```fsharp
member GetSpatialElementFromToCalculationPoints : unit -> IList<XYZ>
```

#### Return Value

IListXYZA list of 3d points.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown if this instance does not have from/to calculation points.. |

For a family instance which connects two rooms or spaces, such as a door or window, the points determine which room or space is considered the "from" and which is considered the "to".

#### Reference

FamilyInstance Class

Autodesk.Revit.DB Namespace